
let str = 'Оценку эффективность созданной ИС и определение целесообразности ее эксплуатации осуществляют\n' +
    '*эксперты\n' +
    'Меткой стрелки в IDEF0 может быть\n' +
    '+Неотглагольное существительное\n' +
    'Именем блока в IDEF0 может быть:\n' +
    '+Глагол+Отглагольное существительное+Словосочетание, содержащее отглагольное существительное\n' +
    'Диаграмма IDEF0. Что помещается обязательно внутри прямоугольника?\n' +
    '+Имя функции+Номер шага алгоритма выполнения функции\n' +
    'Укажите стадии второй фазы жизненного цикла информационной системы\n' +
    '-Разработка эскизного проекта-Разработки технического проекта\n' +
    'Укажите процедуры соответствующие стадии рабочего проектирования.\n' +
    '-Формирование должностных инструкций операторам и пользователям\n' +
    'В информационных системах имеют место процессы:\n' +
    '+ Процесс сбора информации+ Процесс отображения информации+ Процесс обработки информации техническими средствами\n' +
    'Какие процедуры выполняются в процессе параметрического синтеза?\n' +
    '-Определяются количественные значения характеристик, связей, частей объекта проектирования.\n' +
    'Одно и только одно конечное действие обязательно инициализируется. Какое соединение обладает этим правилом инициализации?\n' +
    '+Разворачивающее соединение исклюзивное или\n' +
    'Под автоматизированной системой понимают:\n' +
    '+ Совокупность математических методов, информационных, программных и технических средств, а также коллектив людей, который с помощью этих методов и средств осуществляет процесс управления некоторым объектом.\n' +
    'Одно или несколько конечных действий инициализируется. Какое соединение обладает этим правилом инициализации?\n' +
    '+Разворачивающее соединение ИЛИ\n' +
    'Какому обеспечению соответствует следующее определение? Совокупность материалов, предназначенных для персонала информационной системы, где указываются инструкции для обеспечения эксплуатации и развития автоматизированной системы \n' +
    '+Методическое\n' +
    'Для описания функции используется в IDEF0: \n' +
    '+Прямоугольник\n' +
    'Укажите информационные системы \n' +
    '+Советующие системы +Измерительные системы +Контролирующие системы +Справочные системы\n' +
    'Какие специалисты персонала автоматизированной системы могут не иметь образования в области информатики и вычислительной техники?\n' +
    '+аналитики+эксперты \n' +
    'Компонентой диаграммы IDEF3 является:\n' +
    '+Единица работы+Объектный поток\n' +
    'Разработчика информационного обеспечения могут называть \n' +
    '+инженером по знаниям \n' +
    'Какие процедуры выполняются в процессе структурного синтеза?\n' +
    '-Разрабатывается качественное описание объекта-Определяются отношения и связи между частями объекта-Определяются основные части объекта\n' +
    'Какому приему проектирования соответствует следующее определение: «При проектировании необходимо максимально использовать готовые проектные решения. Эти проектные решения могли быть получены ранее самими проектировщиками или заимствованы у других»?\n' +
    '-Нормализация\n' +
    'Диаграмма IDEF0. Номер блока может быть следующим числом:\n' +
    '+1 +6\n' +
    'Каким понятиям не соответствует следующее определение? Совокупность информации, которая циркулирует в системе управления.\n' +
    '+Методическое +Математическое +Организационное +Техническое \n' +
    'Какой процедуре соответствует следующее определение? Представление информации в виде, удобном для восприятия человеком.\n' +
    '+Отображение\n' +
    'Диаграмма IDEF0. Объединение стрелок называется \n' +
    '+связыванием \n' +
    'Диаграмма IDEF0. Расписание занятий может являться названием для:\n' +
    '+Входной стрелки +Выходной стрелки +Внутренней стрелки \n' +
    'Каждое исходное действие обязательно должно завершиться. Какое соединение обладает этим правилом инициализации?\n' +
    '-Сворачивающее соединение И\n' +
    'Какому понятию соответствует следующее определение? Совокупность . методов, моделей, позволяющих оптимально управлять некоторым процессом:  \n' +
    '+Математическое \n' +
    'Какому приему проектирования соответствует следующее определение? Снижение многообразия элементов системы, требуемых для разработки за счет уменьшения количества элементов, выполняющих одни и те же функции:\n' +
    '+Унификация\n' +
    'Укажите фазы жизненного цикла автоматизированной системы\n' +
    '+Ввод в действие +Проектирования +Предпроектная +Эксплуатация \n' +
    'Соединение на диаграммах IDEF3 бывают:\n' +
    '-Разворачивающее соединение -Сворачивающее соединение\n' +
    'Какие показатели характеризируют выполнение системой заданных функций, при котором показатели качества функционирования соответствуют установленным требованиям?\n' +
    '-Работоспособности\n' +
    'Что означает инвариантность цели?  \n' +
    '+Независимость цели от интервала времени рассмотрения управляемого процесса\n' +
    'Что означает конструктивность цели?\n' +
    '+Наличие в формулировке цели подсказок для ее достижения\n' +
    'К разработчикам автоматизированных систем относят\n' +
    '+аналитик +эксперт\n' +
    'Диаграмма IDEF0. Специальный вид диаграммы, состоящей из одного блока, описывающего функцию верхнего уровня, имеет метку:\n' +
    '+A0\n' +
    'Связать в единое целое все элементы системы, согласовать деятельность всех групп разработчиков входит в обязанности\n' +
    '+системотехника\n' +
    'Диаграмма IDEF0. Стрелка, концы которой связывают источник и потребителя, являющимися блоками одной диаграммы: \n' +
    '+Внутренняя стрелка \n' +
    'В каких системах формируются готовые для выполнения решения? Такие автоматизированные системы могут выдавать несколько отличных друг от друга решений. Из этого множества единственное решение выбирается человеком.\n' +
    '+Советующие системы\n' +
    'Укажите процедуры соответствующие стадии технического проектирования\n' +
    '-Разработка функциональной структуры ИС -Пред проектное обследование\n' +
    'Какие показатели определяется соотношением результатов и затрат при функционировании процесса?\n' +
    '-Экономической эффективности\n' +
    'Какому понятию соответствует следующее определение? Совокупность программных средств, машинных алгоритмов, реализующих математические методы и модели управления процессом. \n' +
    '+Программное \n' +
    'Какой процедуре соответствует следующее определение? Измерение или восприятие информации человеком с последующим преобразованием этой информации в форму, которая позволяет обработать ее или передать. \n' +
    '+Сбор\n' +
    'Для описания функции используется:\n' +
    'Прямоугольник\n' +
    'Стрелка, концы которой связывают источник и потребителя, являющимися блоками одной\n' +
    'Внутренняя стрелка\n' +
    'Стрелка, отображающая данные и материальные объекты, которые преобразуются функцией в выход\n' +
    'Входная стрелка\n' +
    'Стрелка, отображающая данные и материальные объекты, произведенные функцией\n' +
    'Выходная стрелка\n' +
    'Разделение стрелки на два или большее число сегментов.\n' +
    'ветвление\n' +
    'Список определений ключевых слов, фраз, связанных с узлами стрелками, блоками или моделью в целом.\n' +
    'глоссарий\n' +
    'Стрелка, один из концов которой связан с источником или потребителем, а другой не присоединен ни к какому блоку\n' +
    'Выходная стрелка\n' +
    'Разделение моделируемой функции на функции компоненты\n' +
    'декомпозиция\n' +
    'Специальный вид диаграммы, состоящей из одного блока, описывающего функцию верхнего уровня\n' +
    'A-0\n' +
    'Представление отношений между родительскими и дочерними диаграммами\n' +
    'дерево узлов\n' +
    'Именем блока может быть:\n' +
    '+Глагол+Глагольный оборот+Отглагольное существительное+Словосочетание, содержащее отглагольное существительное\n' +
    'Диаграмма, детализирующая функцию.\n' +
    '+Дочерняя диаграмма+Диаграмма, содержащая дочерний блок\n' +
    'Меткой стрелки может быть\n' +
    '+Неотглагольное существительное+Оборот с неотглагольным существительным\n' +
    'Номер блока может быть следующим числом\n' +
    '+1+2+6\n' +
    'Количество блоков диаграммы должно быть меньше следующего целого числа\n' +
    '7\n' +
    'Объединение стрелок называется\n' +
    'cвязыванием\n' +
    'Разделение стрелок называют\n' +
    'развязывание\n' +
    'Направленная линия, состоящая из одного или нескольких сегментов. которая моделирует канал передачи данных или материальных потоков\n' +
    'cтрелка\n' +
    'Стрелки, изображающие средства, используемые для выполнения функций\n' +
    'Стрелка механизма\n' +
    'Стрелки, дочерней диаграммы, отсутствующие на родительской диаграмме\n' +
    'Туннельная\n' +
    'Деятельность, процесс или преобразование\n' +
    'Функция\n' +
    'Стрелки, отображающие условия при которых выполняется функция (приказы, распоряжения, нормативно-справочная информация, и т.д.)\n' +
    'Управляющая\n' +
    'Укажите расположение стрелок блока\n' +
    'Слева~входная Сверху~управляющая Справа~выходная Снизу~стрелка механизма\n' +
    'Что описывает функцию?\n' +
    'Блок\n' +
    'Что помещается внутри блока?\n' +
    '+Имя+Номер\n' +
    'Стрелка может иметь\n' +
    '+Один +Несколько +Линии +Используются сплошные линии +Хотя\n' +
    'Для связи стрелки с именем используется\n' +
    '+Молнеобразная линия +Сплошная линия\n' +
    'Какие термины не должны использоваться в метках стрелок\n' +
    '+функция +вход +управление +выход +механизм +вызов\n' +
    'В диаграмме A-0 допускаются следующие стрелки\n' +
    '-Внутренняя\n' +
    'Какие виды направлений внутренних стрелок и их соединений возможны:\n' +
    '+Выход c входом +Выход c управлением +Выход с механизмом\n' +
    'Как должны располагаться блоки в диаграмме\n' +
    'По диагонали\n' +
    'Блоки обязательно должны иметь\n' +
    '+Управляющую стрелку +Входную стрелку\n' +
    'Обратные стрелки по управлению показываются как\n' +
    'Вверх и над\n' +
    'Обратные стрелки по входу показываются как\n' +
    'Вниз и под\n' +
    'Обратные стрелки по механизму показываются как\n' +
    'Вниз и под\n' +
    'Стрелки объединяют, если они имеют\n' +
    '+Общий источник +Общий приемник\n' +
    'Для описания функции используется:\n' +
    'Прямоугольник\n' +
    'Укажите, что отображается блоками:\n' +
    'Деятельность\n' +
    'Укажите, что отображается стрелками механизма:\n' +
    'Оборудование, Персонал\n' +
    'Укажите, что отображается управляющими стрелками:\n' +
    'Нормативные акты, Ограничительная информация, Предписывающая информация\n' +
    'Укажите, что отображается выходными стрелками:\n' +
    'Нормативные акты,Материальные потоки,Ограничительная информация,Энергетические потоки,Предписывающая информация,Финансовые потоки,Оборудование,Информационные потоки\n' +
    'Укажите, что отображается входными стрелками:\n' +
    'Материальные потоки,Энергетические потоки,Финансовые потоки,Информационные потоки\n' +
    'Укажите название стрелок и процессов:\n' +
    'Управляющая стрелка~Рекомендации,Входная стрелка~Задание,Выходная стрелка~Разработанная,Стрелка механизма~Бригада,Блок~Разработка\n' +
    'Укажите название стрелок и процессов:\n' +
    'Управляющая стрелка~График,Входная стрелка~Приобретаемое,Выходная стрелка~Приобретенное,Стрелка механизма~Отдел,Блок~Приобретение\n' +
    'На какое количество компонент можно разделить моделируемую функцию:\n' +
    '3, 5\n' +
    'Диаграмма содержит два блока. Для составления расписания занятий используется нагрузка учителей и список аудиторий. А для получения нагрузки учителей используется учебный план и список учителей. Какие наименования могут относиться к граничным стрелкам:\n' +
    'Список аудиторий,Учебный план,Список учителей,Расписание занятий\n' +
    'Глоссарий может включать определения ключевых слов со следующими наименованиями:\n' +
    'Деталь,Обработка детали,Работа двигателя,Запись в журнал,Расчет заработной платы\n' +
    'Стрелка разделяется на два сегмента. Какие случаи использования наименований допустимы:\n' +
    'Стрелка и все сегменты имеют разные названия,Стрелка и один сегмент назван, а другой не назван,Стрелка названа, а все сегменты не названы\n' +
    'Диаграмма содержит два блока. Для составления расписания занятий используется нагрузка учителей и список аудиторий. А для получения нагрузки учителей используется учебный план и список учителей. Какие наименования могут относиться к выходной стрелке:\n' +
    'Нагрузка учителей,Расписание занятий\n' +
    'Диаграмма содержит два блока. Для составления расписания занятий используется нагрузка учителей и список аудиторий. А для получения нагрузки учителей используется учебный план и список учителей. Какие наименования могут относиться к входной стрелке:\n' +
    'Список аудиторий,Нагрузка учителей,Учебный план,Список учителей\n' +
    'Диаграмма содержит два блока. Для составления расписания занятий используется нагрузка учителей и список аудиторий. А для получения нагрузки учителей используется учебный план и список учителей. Какие наименования не относятся к внутренней стрелке:\n' +
    'Составление расписания занятий,Список аудиторий,Получение нагрузки учителей,Учебный план,Список учителей,Расписание занятий\n' +
    'Какие название можно указывать для информационного процесса:\n' +
    'Ответить на вопросы экзамена,Трансляция программы\n' +
    'Какие название можно указывать в прямоугольнике:\n' +
    'Входной стрелки,Выходной стрелки,Внутренней стрелки,Граничной стрелки\n' +
    '‘Составление расписания занятий’ не является названием для:\n' +
    'Входной стрелки,Выходной стрелки,Внутренней стрелки,Граничной стрелки\n' +
    'Одно или несколько исходных действий должны завершиться\n' +
    'Сворачивающееся или\n' +
    'Соединение на диаграммах IDEF3 бывают:\n' +
    'Разворач/Сворач соед\n' +
    'Каждое конечное действие обязательно иницилизируется\n' +
    'Разорачивающее И\n' +
    'Каждое исходное действие обязательно должно завершиться.\n' +
    'Сворачивающее И\n' +
    'Одно и только одно конечное действие обязательно иницилизируется.\n' +
    'Разворач ИСКЛ ИЛИ\n' +
    'Компонентой диаграммы IDEF3 является:\n' +
    'Единица работы/Объектный поток\n' +
    'Одно и только одно исходное действие обязательно должно завершиться.\n' +
    'Сворач ИСКЛ ИЛИ\n' +
    'Одно или несколько конечных действий иницилизируется.\n' +
    'Разворач ИЛИ\n' +
    'Элементами диаграммы поведения являются:\n' +
    'ВСЕ\n' +
    'Какие названия информационных процессов в диаграмме поведения допустимы:\n' +
    'СВЕдения/Изготовление\n' +
    'Элементами модели окружения являются диаграмм DFD:\n' +
    'Инф связи/Внеш объекты\n' +
    'Укажите возможные связи между элементами модели окружения:\n' +
    'От внеш к функ/ От функ к внеш\n' +
    'Какие названия хранилищ допустимы:\n' +
    'Сведения/План\n' +
    'Какие названия информационных процессов в диаграмме поведения допустимы:\n' +
    'Вычисление...\n' +
    'Какие названия внешних объектов допустимы:\n' +
    'Студенты/Оператор\n' +
    'Укажите последовательность этапов логического проектирования базы данных\n' +
    'нач/функ/норм/граф\n' +
    'Укажите последовательность действий логического проектирования базы данных\n' +
    'удал/обесп/устран\n' +
    'Какие процедуры относятся к логическому проектированию базы данных:\n' +
    'функ/норм/удал р/удал т/преоб\n' +
    'Укажите соответствие между понятиями концептуальной и реляционной моделью данных\n' +
    '+Связь~Отношение\n' +
    'Продолжите определение: Атрибут B функционально зависит от атрибута A отношения r,  если каждому значению атрибута A во всех элементах отношения r соответствует:\n' +
    '+ровно одно значение атрибута B\n' +
    'Какому понятию соответствует следующее определение? Совокупность программных средств, машинных алгоритмов, реализующих математические методы и модели управления процессом.\n' +
    'Программное\n' +
    'Каким понятиям не соответствует следующее определение? Совокупность информации, которая циркулирует в системе управления.\n' +
    'Метод/Тех/Орг/Мат/Прог/Прав\n' +
    'Какому понятию соответствует следующее определение? Совокупность  методов, моделей, позволяющих оптимально управлять некоторым процессом:\n' +
    'Математическое\n' +
    'Новым стандартом исключены из состава автоматизированной системы следующие обеспечивающие подсистемы\n' +
    'Линг/Эрг\n' +
    'Какие специалисты персонала автоматизированной системы могут не иметь образования в области информатики и вычислительной техники?\n' +
    '+аналитики+эксперты\n' +
    'Оценку эффективность созданной ИС и определение целесообразности ее эксплуатации осуществляют\n' +
    'эксперты\n' +
    'К эксплуатационному персоналу относят\n' +
    '+ администратор базы данных+системный администратор+оператор ЭВМ\n' +
    'К какой группе персонала относят системного администратора\n' +
    'Эксплуатационный\n' +
    'Формулирование проблемы и постановку задач для автоматизированной системы осуществляет\n' +
    'Аналитик|аналитик\n' +
    'Разработчика  информационного обеспечения  могут называть\n' +
    'инженером по знаниям\n' +
    'Связать в единое целое все элементы системы, согласовать деятельность всех групп разработчиков входит в обязанности\n' +
    'системотехника\n' +
    'К разработчикам автоматизированных систем относят\n' +
    '+прикладной программист+аналитик+инженер по знаниям+эксперт\n' +
    'К информационным процессам относятся\n' +
    '+Сбор информации+Отображение информации пользователю+Ввод данных пользователем\n' +
    'Какой процедуре соответствует следующее определение? Измерение или восприятие информации человеком с последующим преобразованием этой информации в форму, которая позволяет обработать ее или передать. \n' +
    'Сбор\n' +
    'Какой процедуре соответствует следующее определение? Представление информации в виде, удобном для восприятия человеком. \n' +
    'Отображение\n' +
    'Назовите прорцедуру при выполнении которой  происходит  перемещение информации в пространстве и во времени?\n' +
    'Передача\n' +
    'Укажите класс систем. Основной функцией систем является  сравнение значений параметров с областью допустимых значений. При выходе параметров за пределы этой области оператору передаются соответствующие сообщения. \n' +
    'Контролирующие системы\n' +
    'В каких системах формируются готовые для выполнения решения? Такие автоматизированные системы могут выдавать несколько отличных друг от друга решений. Из этого множества единственное решение выбирается человеком.\n' +
    'Советующие системы \n' +
    'Укажите управляющие системы\n' +
    '+Следящие+Стабилизации\n' +
    'Укажите класс управляющих систем, которые поддерживают заданные заранее значения параметров управляемого процесса\n' +
    'Стабилизации\n' +
    'Укажите информационные системы\n' +
    '+Измерительные системы+Советующие системы +Контролирующие системы+Информационно-справочные системы\n' +
    'Укажите класс информационных систем, обеспечивающих сбор и отображение информации о наблюдаемом процессе\n' +
    'Измерительные\n' +
    'Укажите классы адаптивных управляющих систем\n' +
    '+Самонастраивающиеся системы+Самоорганизующие системы\n' +
    '\n' +
    '\n' +
    '\n' +
    '\n' +
    '\n'


function createObj (str) {
    let strArr = str.split('\n');
    let testArr = []

    strArr.forEach((item, index, arr) => {
        if (index !== 0 && index % 2 === 1) return
        testArr.push({question: item, answer: arr[index + 1]})
    })

    return testArr;
}

let newTest = createObj(str);

export default newTest
